Catalogs/ШаблоныСплитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Catalog>
		<Properties>
			<Name>ШаблоныСплитов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоТренировочныхДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НагружаемыеГруппыМышц</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерТренировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаМышц</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыМышц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Упражнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерТренировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упражнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Упражнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПодходов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПовторений</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ШаблоныСплитов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для н=0 по Объект.НагружаемыеГруппыМышц.Количество()-1 Цикл
		Строка = Объект.НагружаемыеГруппыМышц[н];
		
		ЭлементГруппа = ЭтаФорма.Элементы.Добавить("ГруппыМышц"+Строка.НомерТренировки+"Строка"+Строка.ГруппаМышц.Наименование,Тип("ГруппаФормы"), Элементы["ГруппыМышц"+Строка.НомерТренировки]);
		ЭлементГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ЭлементГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		ЭлементГруппа.отображатьЗаголовок = Ложь;

				
		ЭлементОтображенияДанных = ЭтаФорма.Элементы.Добавить("ГруппыМышц"+Строка.НомерТренировки+Строка.ГруппаМышц.Наименование,Тип("ДекорацияФормы"), Элементы["ГруппыМышц"+Строка.НомерТренировки+"Строка"+Строка.ГруппаМышц.Наименование]);
		ЭлементОтображенияДанных.Вид = ВидДекорацииФормы.Надпись;
		ЭлементОтображенияДанных.Заголовок = Строка.ГруппаМышц.Наименование;
		
			//Добавляем саму кнопку
		ЭлементКнопка = ЭтаФорма.Элементы.Добавить("ГруппыМышц"+Строка.НомерТренировки+Строка.ГруппаМышц.Наименование+"Изменить", Тип("КнопкаФормы"), Элементы["ГруппыМышц"+Строка.НомерТренировки+"Строка"+Строка.ГруппаМышц.Наименование]);
		ЭлементКнопка.Вид = ВидКнопкиФормы.Гиперссылка;
		ЭлементКнопка.ИмяКоманды = "ИзменитьГруппуМышц"; 
		ЭлементКнопка.Заголовок = "Изменить";
	
			
		ЭлементКнопка = ЭтаФорма.Элементы.Добавить("ГруппыМышц"+Строка.НомерТренировки+Строка.ГруппаМышц.Наименование+"Удалить", Тип("КнопкаФормы"), Элементы["ГруппыМышц"+Строка.НомерТренировки+"Строка"+Строка.ГруппаМышц.Наименование]);
		ЭлементКнопка.Вид = ВидКнопкиФормы.Гиперссылка;
		ЭлементКнопка.ИмяКоманды = "УдалитьГруппуМышц"; 
		ЭлементКнопка.Заголовок = "Удалить";
		//ЭлементКнопка.Картинка = БиблиотекаКартинок.Удалить;
		//ЭлементКнопка.Отображение = ОтображениеКнопки.Картинка;

	КонецЦикла;		

	а=0;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Для н=1 по 7 Цикл
		Элементы["Тренировка"+н].Видимость =  н<=Объект.КоличествоТренировочныхДней ;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоТренировочныхДнейПриИзменении(Элемент)
	Для н=1 по 7 Цикл
		Элементы["Тренировка"+н].Видимость =  н<=Объект.КоличествоТренировочныхДней ;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьГруппуМышц(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьГруппуМышц(Команда)
	а=0;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьГруппуМышц(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры
